XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Geehy.APM32A10x_DFP.pdsc
<?xml version="1.0"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.4" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Geehy</vendor>
    <name>APM32A10x_DFP</name>
    <description>Geehy Semiconductor APM32A10x Series Device Support, Drivers and Examples</description>
    <url>https://www.geehy.com/uploads/tool/</url>
    <supportContact>https://www.geehy.com/support/apm</supportContact>
    <releases>
        <release version="1.0.0" date="2023-03-25">First Release version of APM32A10x Device Family Pack.      </release>
    </releases>
    <keywords>
        <!-- keywords for indexing -->
        <keyword>Geehy</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Geehy Semiconductor</keyword>
        <keyword>APM32A10x</keyword>
        <keyword>APM32</keyword>
    </keywords>
    <devices>
        <family Dfamily="APM32A1 Series" Dvendor="Geehy:163">
            <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>
            <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
            <description>
Geehy Semiconductor' APM32A1 series of mainstream MCUs are 32-bit microprocessors based on ARM Cortex'-M3 core, with a maximum operating frequency of 96MHz, with a maximum operating frequency of 120MHz for APM32A103XE. Built-in AHB high-performance bus, combined with high-speed memory and DMA, can achieve rapid data processing and storage. Built-in APB advanced peripheral bus extends the rich peripherals and enhanced I/O, guarantees the rapidity of connection and flexibility of control. The chip is equipped with powerful FPU floating-point processing unit, which supports single-precision data processing instructions and data types.</description>
            <sequences>
                <!-- Override for Pre-Defined DebugCoreStart Sequence -->
                <sequence name="DebugCoreStart">
                    <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR

            // Device Specific Debug Setup
            Write32(0xE0042004, DbgMCU_CFG);                                         // DBGMCU_CFG: Configure MCU Debug
          </block>
                </sequence>
                <!-- Override for Pre-Defined TraceStart Sequence -->
                <sequence name="TraceStart">
                    <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU Trace Selected?
          </block>
                    <control if="traceSWO">
                        <block>
              Sequence(&quot;EnableTraceSWO&quot;);                                           // Call SWO Trace Setup
            </block>
                    </control>
                    <control if="traceTPIU">
                        <block>
              Sequence(&quot;EnableTraceTPIU&quot;);                                          // Call TPIU Trace Setup
            </block>
                    </control>
                </sequence>
                <!-- User-Defined EnableTraceSWO Sequence -->
                <sequence name="EnableTraceSWO">
                    <block>
            __var dbgmcu_val    = 0;                                                // DBGMCU_CFG Value

            dbgmcu_val  = Read32(0xE0042004) &amp; (~0xE0);                         // Read DBGMCU_CFG and clear trace setup
            dbgmcu_val |= (1 &lt;&lt; 5);                                           // Trace I/O Enable + Trace Mode Asynchronous

            Write32(0xE0042004, dbgmcu_val);                                        // Write DBGMCU_CFG: Trace Settings
          </block>
                </sequence>
                <!-- User-Defined EnableTraceTPIU Sequence -->
                <sequence name="EnableTraceTPIU">
                    <block>
            __var width         = (__traceout &amp; 0x003F0000) &gt;&gt; 16;        // TPIU Port Width
            __var dbgmcu_val    = 0;                                                // DBGMCU_CFG Value

            dbgmcu_val  = Read32(0xE0042004) &amp; (~0xE0);                         // Read DBGMCU_CFG and clear trace setup
            dbgmcu_val |= (1 &lt;&lt; 5);                                           // Trace I/O Enable

          </block>
                    <control if="width == 1">
                        <block>
              // 1-Bit TPIU Trace Setup
              dbgmcu_val    |= (1 &lt;&lt; 6);                                      // Trace Mode (1-Bit)
            </block>
                    </control>
                    <control if="width == 2">
                        <block>
              // 2-Bit TPIU Trace Setup
              dbgmcu_val    |= (2 &lt;&lt; 6);                                      // Trace Mode (2-Bit)
            </block>
                    </control>
                    <control if="width == 4">
                        <block>
              // 4-Bit TPIU Trace Setup
              dbgmcu_val    |= (3 &lt;&lt; 6);                                      // Trace Mode (4-Bit)
            </block>
                    </control>
                    <block>
            // Write Trace Configuration to Target
            Write32(0xE0042004, dbgmcu_val);                                        // Write DBGMCU_CFG: Trace Settings
          </block>
                </sequence>
            </sequences>
            <!-- ************************  Subfamily 'APM32A103'  **************************** -->
            <subFamily DsubFamily="APM32A103">
                <debugvars configfile="Debug/APM32A103.dbgconf" version="1.0.0">
                    __var DbgMCU_CFG      = 0x00000007;   // DbgMCU_CFG:  DBG_SLEEP, DBG_STOP, DBG_STANDBY
                </debugvars>
                <feature type="WDT" n="2"/>
                <feature type="RTC" n="32768"/>
                <feature type="VCC" n="2.00" m="3.60"/>
                <feature type="Temp" n="-40" m="85"/>
                <feature type="Temp" n="-40" m="105"/>
                <feature type="USBD" n="1"/>
                <feature type="CAN" n="1"/>
                <!-- *************************  Device 'APM32A103CB'  ***************************** -->
                <device Dname="APM32A103CB">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
                    <compile header="Device/Device/Geehy/APM32A10x/Include/apm32a10x.h" define="APM32A10X_MD"/>
                    <debug svd="SVD/APM32A103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00020000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00005000" init="0" default="1"/>
                    <algorithm name="Flash/APM32A10x_128.FLM" start="0x08000000" size="0x00020000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32A103 Data Sheet"/>
                    <feature type="Timer" n="5" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="IOs" n="37"/>
                    <feature type="DAC" n="0"/>
                    <feature type="SPI" n="2" m="18000000"/>
                    <feature type="I2S" n="0"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="0"/>
                    <feature type="SDIO" n="0"/>
                    <feature type="QFP" n="64"/>
                    <feature type="CSP" n="64"/>
                </device>
                <!-- *************************  Device 'APM32A103RE'  ***************************** -->
                <device Dname="APM32A103RE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
                    <compile header="Device/Device/Geehy/APM32A10x/Include/apm32a10x.h" define="APM32A10X_HD"/>
                    <debug svd="SVD/APM32A103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <algorithm name="Flash/APM32A10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32A103 Data Sheet"/>
                    <feature type="WDT" n="2"/>
                    <feature type="RTC" n="32768"/>
                    <feature type="VCC" n="2.00" m="3.60"/>
                    <feature type="Temp" n="-40" m="85"/>
                    <feature type="Temp" n="-40" m="105"/>
                    <feature type="CAN" n="2"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                </device>
                <!-- *************************  Device 'APM32A103VE'  ***************************** -->
                <device Dname="APM32A103VE">
                    <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
                    <compile header="Device/Device/Geehy/APM32A10x/Include/apm32a10x.h" define="APM32A10X_HD"/>
                    <debug svd="SVD/APM32A103xx.svd"/>
                    <memory id="IROM1" start="0x08000000" size="0x00080000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <algorithm name="Flash/APM32A10x_512.FLM" start="0x08000000" size="0x00080000" default="1"/>
                    <book name="Documents/DATASHEET.pdf" title="APM32A103 Data Sheet"/>
                    <feature type="WDT" n="2"/>
                    <feature type="RTC" n="32768"/>
                    <feature type="VCC" n="2.00" m="3.60"/>
                    <feature type="Temp" n="-40" m="85"/>
                    <feature type="Temp" n="-40" m="105"/>
                    <feature type="CAN" n="2"/>
                    <feature type="Timer" n="8" m="16"/>
                    <feature type="ADC" n="16" m="12"/>
                    <feature type="DAC" n="2" m="12"/>
                    <feature type="SPI" n="3" m="18000000"/>
                    <feature type="I2S" n="2"/>
                    <feature type="I2C" n="2"/>
                    <feature type="USART" n="3" m="4500000"/>
                    <feature type="UART" n="2" m="4500000"/>
                </device>
            </subFamily>
        </family>
    </devices>
    <conditions>
        <!-- conditions selecting Compiler -->
        <condition id="Compiler ARMCC">
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32A10x">
            <description>Geehy Semiconductor APM32A10x Device</description>
            <require Dvendor="Geehy:163" Dname="APM32A10*"/>
        </condition>
        <condition id="APM32A10x MD">
            <description>Geehy Semiconductor APM32A10x Mid Density Device</description>
            <require Dvendor="Geehy:163" Dname="APM32A103*B"/>
        </condition>
        <condition id="APM32A10x HD">
            <description>Geehy Semiconductor APM32A10x High Density Device</description>
            <require Dvendor="Geehy:163" Dname="APM32A103*E"/>
        </condition>
        <condition id="APM32A10x MD ARMCC">
            <description>filter for APM32A10x Mid Density Device and the ARM compiler</description>
            <require condition="APM32A10x MD"/>
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32A10x HD ARMCC">
            <description>filter for APM32A10x High Density Device and the ARM compiler</description>
            <require condition="APM32A10x HD"/>
            <require Tcompiler="ARMCC"/>
        </condition>
