XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Geehy.APM32A10x_DFP.pdsc
        <condition id="APM32A10x CMSIS">
            <description>Geehy Semiconductor APM32A10x Device with CMSIS</description>
            <require condition="APM32A10x"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>
        <condition id="APM32A10x STDPERIPH">
            <description>Geehy Semiconductor APM32A10x with Standard Peripherals Drivers Framework</description>
            <require condition="APM32A10x CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition>
        <condition id="APM32A10x STDPERIPH RCM">
            <description>Geehy Semiconductor APM32A10x with Standard Peripherals Drivers Framework and RCM</description>
            <require condition="APM32A10x CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM"/>
        </condition>
    </conditions>
    <components>
        <!--Startup-->
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="APM32A10x CMSIS">
            <description>System Startup for Geehy Semiconductor APM32A10x device series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="Device/Device/Geehy/APM32A10x/Include/"/>
                <!-- startup files -->
                <file category="source" name="Device/Device/Geehy/APM32A10x/Source/arm/startup_apm32a10x_md.s" attr="config" version="1.0.0" condition="APM32A10x MD ARMCC"/>
                <file category="source" name="Device/Device/Geehy/APM32A10x/Source/arm/startup_apm32a10x_hd.s" attr="config" version="1.0.0" condition="APM32A10x HD ARMCC"/>
                <!-- system file -->
                <file category="source" name="Device/Device/Geehy/APM32A10x/Source/system_apm32a10x.c" attr="config" version="1.0.0"/>
                <!-- device configuration required by drivers at the moment -->
            </files>
        </component>
        <!-- START: Geehy Semiconductor Standard Peripherals Drivers -->
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.0" condition="APM32A10x STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/StdPeriphDriver/inc/"/>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_misc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_misc.c"/>
                <file category="header" name="Device/Templates/apm32a10x_int.h" attr="template" select="Interrupt Service Routines"/>
                <file category="source" name="Device/Templates/apm32a10x_int.c" attr="template" select="Interrupt Service Routines"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_adc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_adc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BAKPR" Cversion="1.0.0" condition="APM32A10x STDPERIPH">
            <description>Backup registers (BAKPR) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_BAKR      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_bakpr.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_bakpr.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_can.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_can.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.0" condition="APM32A10x STDPERIPH ">
            <description>CRC calculation unit (CRC) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_crc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_crc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_dma.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_dma.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EINT" Cversion="1.0.0" condition="APM32A10x STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_eint.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_eint.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FMC" Cversion="1.0.0" condition="APM32A10x STDPERIPH">
            <description>Flash memory controller driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_fmc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_fmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_gpio.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_gpio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Inter-integrated circuit (I2C) interface driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_I2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_i2c.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_i2c.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SCI2C" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>SC Inter-integrated circuit (SCI2C) interface driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SCI2C      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_sci2c.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_sci2c.c"/>
            </files>
        </component>
