XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Geehy.APM32A10x_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDT" Cversion="1.0.0" condition="APM32A10x STDPERIPH">
            <description>Independent watchdog (IWDT) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_IWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_iwdt.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_iwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PMU" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Power controller (PMU) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_PMU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_pmu.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_pmu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM" Cversion="1.0.0" condition="APM32A10x STDPERIPH">
            <description>Reset and clock management unit (RCM) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RCM</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_rcm.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_rcm.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Serial peripheral interface (SPI) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_spi.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_spi.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="QSPI" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Queued Serial peripheral interface (QSPI) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_QSPI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_qspi.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_qspi.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TMR" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Timers (TMR) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_TMR</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_tmr.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_tmr.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_usart.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_usart.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDT" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_wwdt.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_wwdt.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SMC" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>SMC driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SMC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_smc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_smc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMC" Cversion="1.0.0" condition="APM32A10x STDPERIPH">
            <description>SDRC driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDRC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_dmc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_dmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Digital-to-analog converter (DAC) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DAC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_dac.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_dac.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="1.0.0" condition="APM32A10x STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBGMCU</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_dbgmcu.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_dbgmcu.c"/>
            </files>
        </component>
