XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Geehy.APM32A10x_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="1.0.0" condition="APM32A10x STDPERIPH RCM">
            <description>Secure digital (SDIO) interface driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDIO</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_sdio.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_sdio.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.0" condition="APM32A10x STDPERIPH">
            <description>Real-time clock (RTC) driver for APM32A10x</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_RTC</RTE_Components_h>
            <files>
                <file category="header" name="Device/StdPeriphDriver/inc/apm32a10x_rtc.h"/>
                <file category="source" name="Device/StdPeriphDriver/src/apm32a10x_rtc.c"/>
            </files>
        </component>
        <!-- END: Geehy Semiconductor Standard Peripherals Drivers -->
    </components>
    <boards>
        <board vendor="Geehy" name="APM32A103MINI" revision="Ver 1.0">
            <description>Geehy APM32A103 Development Board</description>
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32A103VE"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32A103"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="3" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="2" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
        </board>
    </boards>
    <examples>
        <example name="APM32A103MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32A103_MINI/Blinky">
            <description>APM32A103MINI Blinky example</description>
            <board name="APM32A103MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32A103MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <category>Getting Started</category>
                <keyword>LED</keyword>
                <keyword>APM32A103</keyword>
            </attributes>
        </example>
    </examples>
</package>
